# Tap definitions
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "github/gh"
tap "fluxcd/tap"


# Terminal tools
brew "bash"               # The GNU Bourne Again SHell (BASH) is a Unix shell.
brew "bat"                # A cat(1) clone with syntax highlighting and Git integration.
brew "bitwarden-cli"      # A command-line interface for Bitwarden password manager.
brew "coreutils"          # The GNU Core Utilities are the basic file, shell and text manipulation utilities of the GNU operating system.
brew "curl"               # A command-line tool for getting or sending data using URL syntax.
brew "fish"               # A smart and user-friendly command-line shell for macOS, Linux, and the rest of the family.
brew "fzf"                # A command-line fuzzy finder written in Go.
brew "grep"               # A command-line utility for searching plain-text data sets for lines that match a regular expression.
brew "jq"                 # A lightweight and flexible command-line JSON processor.
brew "mas"                # A command-line interface for Mac App Store. Allows you to install and update macOS apps from the App Store.
brew "tmux"               # A terminal multiplexer.
brew "tmuxinator"         # A tool for creating and managing tmux sessions easily.
brew "tree"               # A recursive directory listing command that produces a depth indented listing of files.
brew "watch"              # Executes a program periodically, showing output fullscreen.
brew "wget"               # A network utility to retrieve files from the web.
brew "yq"                 # A lightweight and portable command-line YAML processor.

# Containers/Kubernetes related formulas
brew "flux"               # The Kubernetes GitOps operator.
brew "k9s"                # A terminal-based UI to interact with your Kubernetes clusters.
brew "kubectx"            # A utility to switch between kubectl contexts.
brew "podman-compose"     # A script to run docker-compose.yml using Podman.
brew "podman"             # A daemonless container engine for developing, managing, and running OCI Containers.

# Development tools
brew "gh"                 # GitHub's official command-line tool.
brew "git"                # Distributed version control system.
brew "neovim"             # A refactor of the Vim text editor with better extensibility and usability.

# Encryption
brew "age"                # A simple, modern and secure encryption tool with small explicit keys, no config options, and UNIX-style composability.
brew "sops"               # Secrets OPerationS: Encrypt/decrypt Kubernetes secrets.

# Terraform related tools
brew "terraform-docs"     # A utility to generate documentation from Terraform modules in various output formats.
brew "tfenv"              # A version manager for Terraform.
brew "tflint"             # A Terraform linter for detecting errors that can't be detected by terraform plan.
brew "tfsec"              # Security scanner for your Terraform code.


# Productivity Apps
cask "alacritty"          # A cross-platform, GPU-accelerated terminal emulator.
cask "font-caskaydia-cove-nerd-font"   # Nerd Font Caskaydia Cove.
cask "font-hack-nerd-font"   # Nerd Font Hack.
cask "google-cloud-sdk"   # A set of tools for Google Cloud Platform.
cask "logi-options-plus"  # A software for Logitech mice and keyboards to customize settings.
cask "notion"             # A productivity application that provides note-taking, databases, and wikis.
cask "signal"             # A cross-platform encrypted messaging service.
cask "slack"              # A collaboration hub for work.
cask "spotify"            # A digital music service.
cask "visual-studio-code" # A code editor redefined and optimized for building and debugging modern web and cloud applications.


# Mac App Store Apps
mas "Bitwarden", id: 1352778147
mas "Microsoft Remote Desktop", id: 1295203466
mas "Toggl Track", id: 1291898086

# Visual Studio Code Extensions
vscode "aaron-bond.better-comments"
vscode "bierner.markdown-emoji"
vscode "EditorConfig.EditorConfig"
vscode "codezombiech.gitignore"
vscode "fabiospampinato.vscode-todo-plus"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "lokalise.i18n-ally"
vscode "mikestead.dotenv"
vscode "ms-pyright.pyright"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-markdown-notebook"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "skyapps.fish-vscode"
vscode "softwaredotcom.music-time"
vscode "softwaredotcom.swdc-vscode"
vscode "timonwong.shellcheck"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"