tap "fluxcd/tap"
tap "github/gh"
tap "slp/krunkit"
brew "age"
brew "bash"
brew "bat"
brew "bat-extras"
brew "bitwarden-cli"
brew "curl"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "direnv"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "go"
brew "grep"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lolcat"
brew "mas"
brew "molten-vk"
brew "neovim"
brew "nmap"
brew "pipenv"
brew "pnpm"
brew "podman"
brew "podman-compose"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "ripgrep"
brew "scc"
brew "sops"
brew "taskwarrior-tui"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "fluxcd/tap/flux"
brew "slp/krunkit/krunkit"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "insomnia"
cask "logi-options+"
cask "podman-desktop"
cask "raycast"
cask "rectangle"
cask "signal"
cask "spotify"
cask "visual-studio-code"
mas "Bitwarden", id: 1352778147
mas "Diarium", id: 1502834782
mas "Home Assistant", id: 1099568401
mas "Meshtastic", id: 1586432531
mas "Tailscale", id: 1475387142
mas "TickTick", id: 966085870
vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadalli.vscode-nginx-conf"
vscode "amodio.tsl-problem-matcher"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ditrix.ask-me-copilot-tool"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "elagil.pre-commit-helper"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "henoc.svgeditor"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "lokalise.i18n-ally"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-markdown-notebook"
vscode "ms-vscode.vscode-speech"
vscode "orta.vscode-jest"
vscode "perkovec.emoji"
vscode "recca0120.vscode-phpunit"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shevaua.phpcs"
vscode "skyapps.fish-vscode"
vscode "tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "upstash.context7-mcp"
vscode "vector-of-bool.gitflow"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "vscode-nested-tags.vscode-nested-tags"
vscode "xargsuk.checkov-prismaless"
vscode "xdebug.php-debug"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
